import {ButtonTheme, GridSize} from "goodt-ui";
import {GtcDrawer} from "goodt-ui/dist/components";

export class App {
    ButtonTheme = ButtonTheme;
    GridSize = GridSize;

    // Задание:
    // Получите данные пользователя
    // Выведите данные в панель информации о пользователе в читаемом виде
    //      - label / value для одиночных значений
    //      - label / list для массивов
    // При нажатии на кнопку "редактировать", откроется форма редактирования. В ней необходимо:
    //      - сделать удобную валидацию (параметр invalid в gtc-компонентах)
    //      - доработать компонент вывода и редактирования данных о внешности
    // В итоге должны работать - получение, вывод и редактирование пользователя, и сделана правильная и аккуратная верстка
}
